CFD_results/14.3mm-4out/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
81489
(
(0.0203410749337051 0.0652522523401401 1.06652887862984)
(-0.0563106833659697 0.0462177479620769 1.04822936608402)
(0.0261679503405312 0.0214210545494583 1.07291308633549)
(0.000539181159448676 -0.0128204055503034 1.10872926629817)
(-0.00986047571395871 -0.00628471778899502 1.08267836161788)
(-0.0221626419743092 -0.00185106167185345 1.07870491584751)
(-0.0317615717845549 0.0178030701618186 1.05927563617202)
(-0.017750297086514 -0.00343869178028738 1.06035080963412)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
140
(
(4.9937427833029e-12 -1.92484113225799e-13 1.06830300151462)
(1.44171946609791e-12 2.70537865592217e-12 1.06830300151462)
(-2.31145177836848e-13 2.22981139690458e-12 1.06830300151462)
(1.22732833328087e-12 8.72473598205308e-13 1.06830300151462)
(3.69556479163856e-13 4.76259685924061e-13 1.06830300151462)
(-1.3854854440593e-12 2.65241304664936e-12 1.06830300151462)
(1.05510364249907e-13 -1.16190826311158e-13 1.06830300151462)
(-0 -0 1.06830300151462)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
568
(
(0.0868612946274247 -0.228429562536381 -0.33319813845929)
(0.0823791353419553 -0.227633738893617 -0.31916559339475)
(0.041331624210794 -0.133343337118588 -0.30544750001987)
(0.0872625672903214 -0.144705888838097 -0.295224084654236)
(0.0159335745828853 -0.147927084489066 -0.31211354954218)
(0.0411168108912199 -0.12844758582301 -0.314154151862265)
(0.00299632765811332 -0.153432459357675 -0.295365027465331)
(0.00533377610433597 -0.144482539273852 -0.307177876939402)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
