CFD_results/14.3mm-4out/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
231304
(
1.38718481662405e-07
-7.81366577265394e-09
-1.65408793689269e-08
2.11890518620025e-08
-1.26911550511133e-07
-8.64149553985934e-09
-1.22011776008851e-07
-9.61452242109533e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
-7.75637301316386e-08
-6.30406641825519e-08
-2.03528978565181e-07
-2.33442219708952e-07
-6.25090610049352e-08
-7.64100675403211e-08
-2.0204800267767e-07
-2.3120823352078e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
1.35428253714919e-08
8.46144676267496e-09
2.85446836808264e-08
4.89025432464158e-08
5.19276743459574e-08
6.00758531476577e-08
5.826751103883e-08
6.41385642842959e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform -0;
    }
}


// ************************************************************************* //
